## Basic pandas with Series and DataFrame

In [41]:
# import necessary libraries
import pandas as pd

In [42]:
# Create a simple list
data = [1,2,3,4,5]

In [43]:
# print the list
data

[1, 2, 3, 4, 5]

In [44]:
# Check the type of the data
type(data)

list

In [45]:
# Convert the list to a pandas Series
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [46]:
# Check the type of the Series
type(s)

pandas.core.series.Series

In [47]:
# Create a DataFrame from the Series
df = pd.DataFrame(s, columns=['num'])
df

   num
0    1
1    2
2    3
3    4
4    5

In [48]:
# Create a DataFrame from list
df1 = pd.DataFrame(data, columns=['num2'])
df1

   num2
0     1
1     2
2     3
3     4
4     5

In [49]:
# Convert the Series to a DataFrame
s2 = df1['num2']
s2

0    1
1    2
2    3
3    4
4    5
Name: num2, dtype: int64

In [50]:
# Check the type of the Series converted to DataFrame
type(s2)

pandas.core.series.Series

In [51]:
# Create list
data = [[1,2],[3,4],[5,6]]
data

[[1, 2], [3, 4], [5, 6]]

In [52]:
# Create a DataFrame from the list
df = pd.DataFrame(data, columns=['num1', 'num2'])
df

   num1  num2
0     1     2
1     3     4
2     5     6

In [53]:
# Select specific columns from the DataFrame
s = df[['num1', 'num2']]
s

   num1  num2
0     1     2
1     3     4
2     5     6

In [54]:
type(s)

pandas.core.frame.DataFrame

## Dictionary to series and DataFrame

In [55]:
# import necessary libraries
import pandas as pd

In [56]:
# create a dictionary with data
data = {
    'name' : ['Alice', 'Bob', 'Charlie'],
    'age' : [25, 30, 35],
    'city' : ['New York', 'Los Angeles', 'Chicago']
}
data

{'name': ['Alice', 'Bob', 'Charlie'],
 'age': [25, 30, 35],
 'city': ['New York', 'Los Angeles', 'Chicago']}

In [57]:
# create a Series for name from the dictionary
name_series = pd.Series(data['name'], name='name')
name_series

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object

In [58]:
# create a DataFrame for age
df = pd.DataFrame(data)
df

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [59]:
# Create a Series for age
age_series = pd.Series(data['age'], name='age')
age_series

0    25
1    30
2    35
Name: age, dtype: int64

## Set to Series and DataFrame

In [60]:
# import necessary libraries
import pandas as pd

In [61]:
# Create a set
s1 = {1,2,3,4,3,2,1}
s1

{1, 2, 3, 4}

In [62]:
# Check the type of the set
type(s1)

set

In [63]:
# Convert the set to list and convert into a pandas Series
s = pd.Series(list(s1))
s

0    1
1    2
2    3
3    4
dtype: int64

In [64]:
# Create a DataFrame from the set
df = pd.DataFrame(s1, columns=['set_value'] )
df

   set_value
0          1
1          2
2          3
3          4

## Tuple to Series and DataFrame

In [65]:
t = (1,2,4,5,6,7,8, True, False, 'hello', 'world')
s = pd.Series(t)
s

0         1
1         2
2         4
3         5
4         6
5         7
6         8
7      True
8     False
9     hello
10    world
dtype: object

In [66]:
df = pd.DataFrame(t, columns = ['tuple_value'])
df

   tuple_value
0            1
1            2
2            4
3            5
4            6
5            7
6            8
7         True
8        False
9        hello
10       world

In [67]:
# Check the DataFrame information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   tuple_value  11 non-null     object
dtypes: object(1)
memory usage: 220.0+ bytes

## Numeric Data Type in Pandas

In [68]:
import pandas as pd

In [69]:
# creating DataFrame with integer data
date = {
    'age': [25, 30, 35],
    'salary': [50000, 60000, 70000],
}
df = pd.DataFrame(date)
df

   age  salary
0   25   50000
1   30   60000
2   35   70000

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      int64
 1   salary  3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

In [71]:
df.dtypes

age       int64
salary    int64
dtype: object

In [72]:
# changing the data type to int32
df['age'] = df['age'].astype('int32')
df['salary'] = df['salary'].astype('int32')
df

   age  salary
0   25   50000
1   30   60000
2   35   70000

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      int32
 1   salary  3 non-null      int32
dtypes: int32(2)
memory usage: 156.0 bytes

In [74]:
2**32

4294967296

In [75]:
2**32/2

2147483648.0

In [76]:
# changing the data type to int16
df['age'] = df['age'].astype('int16')
df['salary'] = df['salary'].astype('int16')
df

   age  salary
0   25  -15536
1   30   -5536
2   35    4464

In [77]:
2**15

32768

In [78]:
# creating DataFrame with integer data
date = {
    'age': [25, 30, 35],
    'salary': [50000, 60000, 70000],
}
df = pd.DataFrame(date)
df

   age  salary
0   25   50000
1   30   60000
2   35   70000

In [79]:
# changing the data type to float64
df['age'] = df['age'].astype('float64')
df['salary'] = df['salary'].astype('float64')
df

    age   salary
0  25.0  50000.0
1  30.0  60000.0
2  35.0  70000.0

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      float64
 1   salary  3 non-null      float64
dtypes: float64(2)
memory usage: 180.0 bytes

## Object, Datetime Datatype

In [81]:
import pandas as pd

In [82]:
data = {
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35],
    'city': ['New York', 'Los Angeles', 'Chicago'],
    'join_date': ['2020-01-01', '2021-02-15', '2019-03-20']
}
data

{'name': ['Alice', 'Bob', 'Charlie'],
 'age': [25, 30, 35],
 'city': ['New York', 'Los Angeles', 'Chicago'],
 'join_date': ['2020-01-01', '2021-02-15', '2019-03-20']}

In [83]:
df = pd.DataFrame(data)
print(df.dtypes)

name         object
age           int64
city         object
join_date    object
dtype: object

In [84]:
df

      name  age         city   join_date
0    Alice   25     New York  2020-01-01
1      Bob   30  Los Angeles  2021-02-15
2  Charlie   35      Chicago  2019-03-20

In [85]:
# create a list of dates
dates = ['2020-01-01', '2021-02-15', '2019-03-20']
# create a DataFrame with dates
df_dates = pd.DataFrame({'dates': dates})
df_dates

        dates
0  2020-01-01
1  2021-02-15
2  2019-03-20

In [86]:
# check the data types of the DataFrame
df_dates['dates'].dtype

dtype('O')

In [87]:
# covert the 'dates' column to datetime
timestamps = pd.to_datetime(dates)
df2 = pd.DataFrame({'dates': timestamps})
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dates   3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 156.0 bytes

In [88]:
df2

       dates
0 2020-01-01
1 2021-02-15
2 2019-03-20

In [89]:
import pandas as pd

# create a list of dates
dates = ['2020', '2021-05-9', '2019']

# create a DataFrame with dates
# df_dates = pd.DataFrame({'dates': dates})

# convert the list to datetime
timestamps = pd.to_datetime(dates, format='mixed')

# create a new DataFrame with datetime values
df2 = pd.DataFrame({'dates2': timestamps})

# check the data type of the 'dates2' column
print(df2['dates2'].dtype)


# print(dates)
# timestamps = pd.to_datetime(dates, errors='coerce')
# invalid_dates = df_dates[pd.to_datetime(df_dates['dates'], errors='coerce').isna()]
# print("Invalid dates:", invalid_dates)
# timestamps = pd.to_datetime(dates, format = '%Y-%m-%d', errors='coerce')
# timestamps

datetime64[ns]

In [90]:
df2['dates2'].dtype

dtype('<M8[ns]')

In [91]:
df2

      dates2
0 2020-01-01
1 2021-05-09
2 2019-01-01

In [92]:
datetime = ['2020-10-01 12:00:00.2521414484', '2021-05-09 14:30:00.1234567890', '2019-03-20 08:15:30.9876543210']
timestamps = pd.to_datetime(datetime)
df = pd.DataFrame({'datetime': timestamps})

In [93]:
print(df['datetime'].dtype)

datetime64[ns]

In [94]:
df

                       datetime
0 2020-10-01 12:00:00.252141448
1 2021-05-09 14:30:00.123456789
2 2019-03-20 08:15:30.987654321

In [95]:
timestamps = pd.to_datetime(datetime)
series = pd.Series(timestamps)
series

0   2020-10-01 12:00:00.252141448
1   2021-05-09 14:30:00.123456789
2   2019-03-20 08:15:30.987654321
dtype: datetime64[ns]

In [96]:
series.info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 156.0 bytes

### Pandas library
Useful for Data Processing & Analysis

Pandas DataFrame:
Pandas DataFrame is two-dimensional tabular data structure with labeled axes (rows and columns).

In [97]:
import numpy as np
labels = ['a', 'b', 'c']
my_data = [1, 2, 3]
arr = np.array(my_data)
d = {'a': 1, 'b': 2, 'c': 3}

In [98]:
pd.Series(data=my_data, index=labels)

a    1
b    2
c    3
dtype: int64

In [99]:
d

{'a': 1, 'b': 2, 'c': 3}

In [100]:
type(d)

dict

In [101]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [102]:
pd.Series(arr,labels)

a    1
b    2
c    3
dtype: int32

In [103]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [104]:
pd.Series(my_data)

0    1
1    2
2    3
dtype: int64

In [105]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [106]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [107]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [108]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [109]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])

In [110]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [111]:
ser1[1]

C:\Users\rashe\AppData\Local\Temp\ipykernel_3524\2158219610.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser1[1]

2

In [112]:
ser1['Germany']

2

In [113]:
ser3 = pd.Series(data=labels)

In [114]:
ser3

0    a
1    b
2    c
dtype: object

In [115]:
ser3[0]

'a'

In [116]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [117]:
from numpy.random import randn

***np.random.seed(101)*** : when we execute the random method for more than one time the number sequence always be change but when we use the ***np.random.seed(101)*** method the sequence will be not change......

In [118]:
np.random.seed(101)

In [119]:
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [120]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [121]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [122]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [123]:
type(df)

pandas.core.frame.DataFrame

In [124]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [126]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [127]:
df['new'] = df['W'] + df['Z']

In [128]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [129]:
df.drop('new', axis=1, inplace=True)

In [130]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [131]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [132]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [133]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [134]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [135]:
df.shape

(5, 4)

In [136]:
df.loc[['A','B'],['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965

In [137]:
booldf = df > 0

In [138]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [139]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [140]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [141]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [142]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [143]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [144]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [145]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [146]:
result = df[df['W']>0]

In [147]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [148]:
result['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [149]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [150]:
df[df['W'] > 0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [151]:
boolser = df['W']>0

In [152]:
bool

bool

In [153]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [154]:
result = df[boolser]
mycols = ['Y', 'X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [155]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [156]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [157]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [158]:
newindex = 'CA NY WY OR CO'.split()
newindex

['CA', 'NY', 'WY', 'OR', 'CO']

In [159]:
df['States'] = newindex

In [160]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [161]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [162]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [163]:
import pandas as pd
import numpy as np

In [164]:
# index level 
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [165]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [166]:
inside

[1, 2, 3, 1, 2, 3]

In [167]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [168]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [169]:
df = pd.DataFrame(randn(6,2), hier_index,['A', 'B'])

In [170]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [171]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [172]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [173]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [174]:
df.index.names

FrozenList([None, None])

In [175]:
df.index.names = ['Groups', 'Num']

In [176]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [177]:
df.loc['G2'].loc[2].loc['B']

0.07295967531703869

In [178]:
df.loc['G1'].loc[1].loc['A']

0.3026654485851825

In [179]:
df.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646>

In [180]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [181]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [182]:
import numpy as np
import pandas as pd

In [183]:
d = {
    'A': [1, 2, np.nan],
    'B': [5, np.nan, np.nan],
    'C': [9, 10, 11]
    }

In [184]:
df = pd.DataFrame(d)

In [185]:
df

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  NaN  NaN  11

In [186]:
df.dropna(axis=1)

    C
0   9
1  10
2  11

In [187]:
df.dropna()

     A    B  C
0  1.0  5.0  9

In [188]:
df.dropna(thresh=2)

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10

In [189]:
df

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  NaN  NaN  11

In [190]:
df.fillna(value='Fill Value')

            A           B   C
0         1.0         5.0   9
1         2.0  Fill Value  10
2  Fill Value  Fill Value  11

In [191]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [192]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [193]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales':[200, 120, 340, 124, 243, 150]
}

In [194]:
df = pd.DataFrame(data)

In [195]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    150

In [196]:
byComp = df.groupby('Company')

In [197]:
byComp

In [198]:
byComp.mean('Sales')

         Sales
Company
FB       196.5
GOOG     160.0
MSFT     232.0

In [199]:
byComp.sum('Sales')

         Sales
Company
FB         393
GOOG       320
MSFT       464

In [204]:
byComp['Sales'].std()

Company
FB       65.760931
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [205]:
byComp.sum()

             Person  Sales
Company
FB        CarlSarah    393
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [207]:
df.groupby('Company').sum().loc['FB']

Person    CarlSarah
Sales           393
Name: FB, dtype: object

In [208]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    243
GOOG         Sam    200
MSFT     Vanessa    340

In [210]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   196.500000  160.000000  232.000000
      std     65.760931   56.568542  152.735065
      min    150.000000  120.000000  124.000000
      25%    173.250000  140.000000  178.000000
      50%    196.500000  160.000000  232.000000
      75%    219.750000  180.000000  286.000000
      max    243.000000  200.000000  340.000000

In [215]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index = [0, 1, 2, 3])

In [220]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                        index = [4, 5, 6, 7])

In [221]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index = [8, 9, 10, 11])

In [222]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [223]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [224]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation 

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. We can use **pd.concat** and pass in a list of DataFrames to concatenate together.

In [225]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [226]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Examples DataFrames

In [227]:
left = pd.DataFrame({   'key': ['K0', 'K1', 'K2', 'K3'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({  'key': ['K0', 'K1', 'K2', 'K3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [228]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [229]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging 

The **merge** function allows us to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [230]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [237]:
left = pd.DataFrame({   'key1': ['K0', 'K0', 'K1', 'K2'],
                        'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({  'key1': ['K0', 'K1', 'K1', 'K2'],
                        'key2': ['K0', 'K0', 'K0', 'K0'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [238]:
pd.merge(left, right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [240]:
pd.merge(left, right, how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [241]:
pd.merge(left, right, how='right', on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [242]:
pd.merge(left, right, how='left', on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrame into a single result DataFrame.

In [246]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2']},
                        index = ['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                        'D': ['D0', 'D2', 'D3']},
                        index = ['K0', 'K2', 'K3'])

In [247]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [248]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [251]:
df = pd.DataFrame({'col1': [1, 2, 3, 4],
                        'col2': [444, 555, 666, 444],
                        'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [253]:
len(df['col2'].unique())

3

In [254]:
df['col2'].nunique()

3

In [256]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [257]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [258]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [259]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [260]:
def times2(x):
    return x*2

In [261]:
df['col1'].sum()

10

In [262]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [263]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [264]:
df['col3'].apply(lambda x: x*2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [265]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [266]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [267]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [268]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [269]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [272]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [273]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [274]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one'],
        'C': ['x', 'y', 'z', 'x', 'y', 'z'],
        'D': [1, 3, 2, 5, 4, 1]}
df = pd.DataFrame(data)

In [275]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  z  2
3  bar  two  x  5
4  bar  one  y  4
5  bar  one  z  1

In [276]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y    z
A   B
bar one  NaN  4.0  1.0
    two  5.0  NaN  NaN
foo one  1.0  3.0  NaN
    two  NaN  NaN  2.0

In [1]:
import pandas as pd

In [3]:
data = pd.read_csv('diabetes.csv')

In [4]:
df = pd.DataFrame(data)

In [5]:
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [6]:
type

type

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
print(data)

     Pregnancies  Glucose  BloodPressure  SkinThickness  Insulin   BMI  \
0              6      148             72             35        0  33.6
1              1       85             66             29        0  26.6
2              8      183             64              0        0  23.3
3              1       89             66             23       94  28.1
4              0      137             40             35      168  43.1
..           ...      ...            ...            ...      ...   ...
763           10      101             76             48      180  32.9
764            2      122             70             27        0  36.8
765            5      121             72             23      112  26.2
766            1      126             60              0        0  30.1
767            1       93             70             31        0  30.4

     DiabetesPedigreeFunction  Age  Outcome
0                       0.627   50        1
1                       0.351   31        0
2                       0.672   32        1
3                       0.167   21        0
4                       2.288   33        1
..                        ...  ...      ...
763                     0.171   63        0
764                     0.340   27        0
765                     0.245   30        0
766                     0.349   47        1
767                     0.315   23        0

[768 rows x 9 columns]

In [9]:
df.mean()

Pregnancies                   3.845052
Glucose                     120.894531
BloodPressure                69.105469
SkinThickness                20.536458
Insulin                      79.799479
BMI                          31.992578
DiabetesPedigreeFunction      0.471876
Age                          33.240885
Outcome                       0.348958
dtype: float64

In [10]:
df.max()

Pregnancies                  17.00
Glucose                     199.00
BloodPressure               122.00
SkinThickness                99.00
Insulin                     846.00
BMI                          67.10
DiabetesPedigreeFunction      2.42
Age                          81.00
Outcome                       1.00
dtype: float64

In [11]:
df.min()

Pregnancies                  0.000
Glucose                      0.000
BloodPressure                0.000
SkinThickness                0.000
Insulin                      0.000
BMI                          0.000
DiabetesPedigreeFunction     0.078
Age                         21.000
Outcome                      0.000
dtype: float64

In [13]:
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [14]:
df.groupby('Outcome').mean()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age
Outcome,,,,,,,,
0,3.298000,109.980000,68.184000,19.664000,68.792000,30.304200,0.429734,31.190000
1,4.865672,141.257463,70.824627,22.164179,100.335821,35.142537,0.550500,37.067164

In [15]:
df.shape

(768, 9)

In [16]:
df.tail()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [19]:
df.isnull()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
763,False,False,False,False,False,False,False,False,False
764,False,False,False,False,False,False,False,False,False
765,False,False,False,False,False,False,False,False,False
766,False,False,False,False,False,False,False,False,False
767,False,False,False,False,False,False,False,False,False

In [20]:
df.value_counts()

Pregnancies  Glucose  BloodPressure  SkinThickness  Insulin  BMI   DiabetesPedigreeFunction  Age  Outcome
12           140      82             43             325      39.2  0.528                     58   1          1
             121      78             17             0        26.5  0.259                     62   0          1
             106      80             0              0        23.6  0.137                     44   0          1
             100      84             33             105      30.0  0.488                     46   0          1
             92       62             7              258      27.6  0.926                     44   1          1
                                                                                                            ..
0            78       88             29             40       36.9  0.434                     21   0          1
             74       52             10             36       27.8  0.269                     22   0          1
             73       0              0              0        21.1  0.342                     25   0          1
             67       76             0              0        45.3  0.194                     46   0          1
             57       60             0              0        21.7  0.735                     67   0          1
Name: count, Length: 768, dtype: int64

In [21]:
df.value_counts('Outcome')

Outcome
0    500
1    268
Name: count, dtype: int64

In [22]:
df.count()

Pregnancies                 768
Glucose                     768
BloodPressure               768
SkinThickness               768
Insulin                     768
BMI                         768
DiabetesPedigreeFunction    768
Age                         768
Outcome                     768
dtype: int64

In [23]:
df.std()

Pregnancies                   3.369578
Glucose                      31.972618
BloodPressure                19.355807
SkinThickness                15.952218
Insulin                     115.244002
BMI                           7.884160
DiabetesPedigreeFunction      0.331329
Age                          11.760232
Outcome                       0.476951
dtype: float64

In [24]:
df.describe()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958
std,3.369578,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [25]:
df['ProcessedGlucose'] = df.Outcome

In [26]:
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome,ProcessedGlucose
0,6,148,72,35,0,33.6,0.627,50,1,1
1,1,85,66,29,0,26.6,0.351,31,0,0
2,8,183,64,0,0,23.3,0.672,32,1,1
3,1,89,66,23,94,28.1,0.167,21,0,0
4,0,137,40,35,168,43.1,2.288,33,1,1
...,...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0,0
764,2,122,70,27,0,36.8,0.340,27,0,0
765,5,121,72,23,112,26.2,0.245,30,0,0
766,1,126,60,0,0,30.1,0.349,47,1,1
767,1,93,70,31,0,30.4,0.315,23,0,0

In [27]:
df.drop('ProcessedGlucose', axis=1, inplace=True)

In [28]:
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [29]:
df.drop(index=1, axis = 0)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
5,5,116,74,0,0,25.6,0.201,30,0
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [30]:
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [31]:
df.iloc[2]

Pregnancies                   8.000
Glucose                     183.000
BloodPressure                64.000
SkinThickness                 0.000
Insulin                       0.000
BMI                          23.300
DiabetesPedigreeFunction      0.672
Age                          32.000
Outcome                       1.000
Name: 2, dtype: float64

In [32]:
print(df.iloc[:,0])

0       6
1       1
2       8
3       1
4       0
       ..
763    10
764     2
765     5
766     1
767     1
Name: Pregnancies, Length: 768, dtype: int64

In [33]:
df.corr()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
Pregnancies,1.000000,0.129459,0.141282,-0.081672,-0.073535,0.017683,-0.033523,0.544341,0.221898
Glucose,0.129459,1.000000,0.152590,0.057328,0.331357,0.221071,0.137337,0.263514,0.466581
BloodPressure,0.141282,0.152590,1.000000,0.207371,0.088933,0.281805,0.041265,0.239528,0.065068
SkinThickness,-0.081672,0.057328,0.207371,1.000000,0.436783,0.392573,0.183928,-0.113970,0.074752
Insulin,-0.073535,0.331357,0.088933,0.436783,1.000000,0.197859,0.185071,-0.042163,0.130548
BMI,0.017683,0.221071,0.281805,0.392573,0.197859,1.000000,0.140647,0.036242,0.292695
DiabetesPedigreeFunction,-0.033523,0.137337,0.041265,0.183928,0.185071,0.140647,1.000000,0.033561,0.173844
Age,0.544341,0.263514,0.239528,-0.113970,-0.042163,0.036242,0.033561,1.000000,0.238356
Outcome,0.221898,0.466581,0.065068,0.074752,0.130548,0.292695,0.173844,0.238356,1.000000